In [104]:
import pandas as pd

In [105]:
df = pd.read_csv('./data/206/Daily-Sales-206-2018-2019.csv')

In [22]:
df['Date'] = pd.to_datetime(df['Date'])

In [9]:
df.set_index('Date', inplace=True)

In [106]:
df.columns

Index(['Store Number', 'Date', 'Gross Amount', 'Net Amount',
       'Store Ticket Net Amount', 'Warranty Amount',
       'Average Included Bay Time', 'Store Ticket Count',
       'Store Ticket Average Net', 'Promotion Amount'],
      dtype='object')

In [75]:
df.dtypes

ds    datetime64[ns]
y             object
dtype: object

In [24]:
df.head()

,Store Number,Date,Gross Amount,Net Amount,Store Ticket Net Amount,Warranty Amount,Average Included Bay Time,Store Ticket Count,Store Ticket Average Net,Promotion Amount
0,206,2018-01-02,"$9,956.10","$9,266.48","$9,266.48",$0.00,14.2,65,$142.56,$689.62
1,NaN,2018-01-03,"$10,496.51","$10,216.44","$10,209.44",$0.00,11.3,77,$132.59,$280.07
2,NaN,2018-01-04,"$5,391.78","$5,064.18","$5,030.19",$0.00,14.8,64,$78.60,$327.60
3,NaN,2018-01-05,"$10,007.91","$9,522.35","$9,522.35",$0.00,12.5,80,$119.03,$485.56
4,NaN,2018-01-06,"$11,541.99","$10,791.46","$10,784.46",$0.00,13.2,93,$115.96,$750.53

In [107]:
df.drop(columns=(['Store Number', 'Gross Amount', 'Store Ticket Net Amount',
       'Warranty Amount', 'Average Included Bay Time', 'Store Ticket Count',
       'Store Ticket Average Net', 'Promotion Amount']), inplace=True)

In [108]:
df

           Date     Net Amount
0    01/02/2018      $9,266.48
1    01/03/2018     $10,216.44
2    01/04/2018      $5,064.18
3    01/05/2018      $9,522.35
4    01/06/2018     $10,791.46
..          ...            ...
717  12/29/2019      $5,255.06
718  12/30/2019      $7,505.02
719  12/31/2019      $9,298.84
720         NaN  $4,664,258.12
721         NaN  $4,664,258.12

[722 rows x 2 columns]

In [109]:
df.rename(columns={"Date": "ds", "Net Amount": "y"}, inplace=True)

In [110]:
df.dropna(inplace=True)

In [122]:
df['y'] = df['y'].str.replace('$', '').str.replace(',', '')

In [123]:
df

             ds         y
0    01/02/2018   9266.48
1    01/03/2018  10216.44
2    01/04/2018   5064.18
3    01/05/2018   9522.35
4    01/06/2018  10791.46
..          ...       ...
715  12/27/2019   9252.11
716  12/28/2019   5504.25
717  12/29/2019   5255.06
718  12/30/2019   7505.02
719  12/31/2019   9298.84

[720 rows x 2 columns]

In [124]:
df.dtypes

ds    object
y     object
dtype: object

In [126]:
df['y'] = pd.to_numeric(df['y'])

In [127]:
df.dtypes

ds     object
y     float64
dtype: object

In [128]:
df.to_csv('Forecast-ex.csv', index=False)